#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Wed Dec 13 18:09:30 2023

@author: jack


首先介绍这三个概念，很多人都听过最短路径了，但是最短路径树却很少听过，关于最短路径树的介绍也不太多。而最短路径树和最小生成树更是完全不同的两个概念。
       最短路径就是从一个指定的顶点出发，计算从该顶点出发到其他所有顶点的最短路径。通常用Dijkstra算法，Floyd算法求解。
       最短路径树SPT（Short Path Tree）是网络的源点到所有结点的最短路径构成的树。
       最小生成树是用和最少的边集将一个图连成任意2点可达，并且这个边集的总长度最小。保证整个拓扑图的所有路径之和最小。通常用Prim算法和kruskal算法求解。




 一个连通图的生成树是一个极小连通子图，它含有图中全部顶点，但只有构成一棵树的(n-1)条边。
如果在一棵生成树上添加一条边，必定构成一个环。
一棵有n个顶点的生成树(连通无回路图)有且仅有(n-1)条边，如果一个图有n个顶点和小于(n-1)条边，则是非连通图。
如果它多于(n-1)条边，则一定有回路。但是，有(n-1)条边的图不一定都是生成树。
最小生成树：图的所有生成树中具有边上的权值之和最小的树。
按照生成树的定义，n个顶点的连通图的生成树有n个顶点、n-1条边。

因此，构造最小生成树的准则有三条：
    （1）必须只使用该图中的边来构造最小生成树；
    （2）必须使用且仅使用n-1条边来连接图中的n个顶点；
    （3）不能使用产生回路的边。

https://zhuanlan.zhihu.com/p/136387766


https://blog.csdn.net/kong_xz/article/details/79540273




"""

