clc;
clear all;
close all;
%----------------------------------------------------------------填放数据--------------------------------------------------------------------
%polar N=64 k=42 CRC=11 order=2


%---------------第一组数据-----------------
%CASCL L=32
CASCL32 = [
1.000000  0.086493890  0.663716814  452
1.500000  0.063145323  0.485436893  618
2.000000  0.039108187  0.328947368  912
2.500000  0.019538818  0.171919771  1745
3.000000  0.008498403  0.080149613  3743
3.500000  0.003579124  0.032869508  9127
4.000000  0.000857407  0.008479846  35378
4.500000  0.000202230  0.002092036  143401
5.000000  0.000025335  0.000261231  1148410

];

%---------------第二组数据-----------------
%OSD order=2
OSD = [
1.000000    0.056451613    0.322580645     904.000000      930
1.500000    0.032654792    0.190839695     904.000000      1572
2.000000    0.013935404    0.080840744     904.000000      3711
2.500000    0.006083381    0.039067587     904.000000      7679
3.000000    0.001892966    0.012262917     904.000000      24464
3.500000    0.000522304    0.003608024     904.000000      83148
4.000000    0.000113919    0.000839896     904.000000      357187
4.500000    0.000019703    0.000158126     904.000000      1897216
5.000000    0.000002918    0.000024978     904.000000      12010709

];

%-------------第三组数据---------------
%OSD order=2 pnc psc T=3 lambda=0.5
OSD_pnc_psc = [
1.000000    0.051891368    0.290979631     215.903977      1031
1.500000    0.028563505    0.166389351     155.719911      1803
2.000000    0.013650113    0.080407397     100.439828      3731
2.500000    0.006076154    0.037807183     59.751481      7935
3.000000    0.001928225    0.012634239     30.918467      23745
3.500000    0.000560491    0.003863341     14.621753      77653
4.000000    0.000122103    0.000914687     6.524878      327981
4.500000    0.000024157    0.000198551     3.087836      1510944
5.000000    0.000004407    0.000039779     1.754049      7541743
];


%---------------第四组数据-----------------
%PB_OSD  order=2
PB_OSD = [
1.000000    0.053260073    0.307692308     106.668718      975
1.500000    0.032135463    0.186335404     88.292547      1610
2.000000    0.015147491    0.092965603     64.745274      3227
2.500000    0.006739958    0.042912316     41.887141      6991
3.000000    0.001813302    0.011924636     23.621313      25158
3.500000    0.000576311    0.004081799     15.677824      73497
4.000000    0.000123972    0.000951888     15.298538      315163
4.500000    0.000026309    0.000228617     11.946253      1312239
5.000000    0.000005368    0.000051245     5.930763      5854276

];


%-------------第五组数据---------------
%Proposed noOrder 
OSD_proposednoOrder = [
1.000000    0.059996757    0.340522134     17.070375      881
1.500000    0.035697705    0.208913649     16.237465      1436
2.000000    0.015816168    0.093428838     12.779508      3211
2.500000    0.007237773    0.046175158     10.197014      6497
3.000000    0.002205514    0.014354067     6.417799      20900
3.500000    0.000577037    0.003997069     4.139178      75055
4.000000    0.000129981    0.000967945     2.770971      309935
4.500000    0.000021595    0.000175209     2.009416      1712243
5.000000    0.000003039    0.000025594     1.640948      11721625

];

%-------------第六组数据---------------
%NA bound 
NA_bound = [
0.409006879220056   0.500000 
0.719006879220054  0.400000 
1.04400687922006   0.300000 
1.40400687922006   0.200000 
1.88400687922006   0.100000 
2.25900687922006   0.050000 
2.89900687922006   0.010000  
3.11400687922006   0.005000 
3.52900687922006   0.001000 
3.68400687922006   0.000500  
3.98400687922006   0.000100 
4.09900687922006   0.000050 
4.23900687922006   0.000020 
4.3390068792200   0.000010  
  
];

%----------------------------------------------------------------开始画图--------------------------------------------------------------------

width = 7;%设置图宽，这个不用改
height = 6.3*0.75;%设置图高，这个不用改
fontsize = 12;%设置图中字体大小
linewidth = 1.5;%设置线宽，一般大小为2，好看些。1是默认大小
marksize = 6;%标记的大小，按照个人喜好设置

%-------------------Figure1----------------------
h1 = figure(1);
%这是用于裁剪figure的。需要把fig.m文件放在一个文件夹中
fig(h1, 'units','inches','width',width, 'height', height, 'font','Times New Roman','fontsize',fontsize);
axes1 = axes('Parent',h1, 'Position',[0.091785714285714 0.1099604743083 0.390357142857143 0.858418972332016]);%left bottom width heigh
%颜色集合，这是默认的八种颜色，颜色的数量可以更改0.101785714285714 0.1699604743083 0.380357142857143 0.798418972332016
ColorSet = [
    0           1           0
   0.7500      0           0.7500
    0           0           1.0000
    0           0.5000      0
    1.0000      0           0
    0           0.7500      0.7500
    0.7500      0.7500      0
     0.2500      0.2500      0.2500
    
    ];
%设置循环使用的颜色集合
set(gcf, 'DefaultAxesColorOrder', ColorSet);
%纵坐标对数域，如果不需要对数改为plot
semilogy(CASCL32(:,1), CASCL32(:,3), '-s',...
    OSD(:,1), OSD(:,3), '-^',...
    OSD_pnc_psc(:,1), OSD_pnc_psc(:,3), '-*',...
    PB_OSD(:,1), PB_OSD(:,3),'-+',...
    OSD_proposednoOrder(:,1), OSD_proposednoOrder(:,3), '-p',...
    NA_bound(:,1), NA_bound(:,2), 'k--'); 
hold on;
grid on;
% set(gca,'GridLineStyle','-','Gridalpha',0.5,'MinorGridLineStyle',':','MinorGridalpha',0.5);
%图例，与上面的曲线先后对应
legend('CA-SCL (L=32)',...
    'OSD (order=2)',...
    'Fast-OSD (order=2)',...
    'PB-OSD (order=2)',...
    'LB-OSD',...
    'Normal approximation');
xlabel('{\it E_b/N}_0(dB)');%横坐标标号
ylabel('BLER');%纵坐标标号
% title('Polar code, N=64 k=42 CRC\_length=11');
set(get(gca,'Children'),'linewidth',linewidth,'markersize', marksize);%设置图中线宽,标记大小
set(gca, 'XTick', 0:0.5:11);%设置横坐标
axis([1 5 2e-5 1]);%横纵坐标范围
% print(gcf, '-depsc', 'FER.eps');%保存为eps格式的图片color
% print(gcf, '-dpng', 'FER.png');%保存为pdf格式的图片color
% print(gcf, '-dpdf', 'FER.pdf');%保存为pdf格式的图片color
%-------------------------Figure1----------------------------


%-------------------------Figure3-----------------------------

%这是用于裁剪figure的。需要把fig.m文件放在一个文件夹中
% fig(h1, 'units','inches','width',width, 'height', height, 'font','Times New Roman','fontsize',fontsize);
axes2 = axes('Parent',h1,...
    'Position',[0.59642857142857 0.1099604743083 0.390357142857143 0.858418972332016]);
%颜色集合，这是默认的八种颜色，颜色的数量可以更改
% ColorSet = [
%     0           0           1.0000
%     0           0.5000      0
%     1.0000      0           0
%     0           0.7500      0.7500
%     0.7500      0           0.7500
%     0.7500      0.7500      0
%     0.2500      0.2500      0.2500
%     ];
ColorSet = [
    
   0.7500      0           0.7500
    0           0           1.0000
    0           0.5000      0
    1.0000      0           0
    0           0.7500      0.7500
    0.7500      0.7500      0
     0.2500      0.2500      0.2500
    0           1           0
    ];

%设置循环使用的颜色集合
set(gcf, 'DefaultAxesColorOrder', ColorSet);
%纵坐标对数域，如果不需要对数改为plot
plot(OSD(:,1), OSD(:,4), '-^',...
    OSD_pnc_psc(:,1), OSD_pnc_psc(:,4), '-*',...
    PB_OSD(:,1), PB_OSD(:,4),'-+',...
    OSD_proposednoOrder(:,1), OSD_proposednoOrder(:,4), '-p'); 
hold on;
grid on;
% set(gca,'GridLineStyle','-','Gridalpha',0.5,'MinorGridLineStyle','-','MinorGridalpha',0.5);
%图例，与上面的曲线先后对应
legend('OSD (order=2)',...
    'Fast-OSD (order=2)',...
    'PB-OSD (order=2)',...
    'LB-OSD');
% title('Polar code, N=64 k=42 CRC\_length=11 ');
xlabel('{\it E_b/N}_0(dB)');%横坐标标号
ylabel('Average TEP number');%纵坐标标号
set(get(gca,'Children'),'linewidth',linewidth,'markersize', marksize);%设置图中线宽,标记大小
set(gca, 'XTick', 0:0.5:11);%设置横坐标
% axis([1 5 0 500]);%横纵坐标范围
print(gcf, '-depsc', 'BLER_complexity.eps');%保存为eps格式的图片color
print(gcf, '-dpng', 'BLER_complexity.png');%保存为pdf格式的图片color
print(gcf, '-dpdf', 'BLER_complexity.pdf');%保存为pdf格式的图片color
%-------------------------Figure3-----------------------------


%-------------------------Figure2-----------------------------
% axes2 = axes('Parent',h1,...
%     'Position',[0.59642857142857 0.1699604743083 0.380357142857143 0.798418972332016]);
% 
% %这是用于裁剪figure的。需要把fig.m文件放在一个文件夹中
% fig(h1, 'units','inches','width',width, 'height', height, 'font','Times New Roman','fontsize',fontsize);
% %颜色集合，这是默认的八种颜色，颜色的数量可以更改
% ColorSet = [...
%     0           0           1.0000
%     0           0.5000      0
%     1.0000      0           0
%     0           0.7500      0.7500
%     0.7500      0           0.7500
%     0.7500      0.7500      0
%     0.2500      0.2500      0.2500
%     ];
% %设置循环使用的颜色集合
% set(gcf, 'DefaultAxesColorOrder', ColorSet);
% %纵坐标对数域，如果不需要对数改为plot
% semilogy(OSD3(:,1), OSD3(:,2), 'b-h',...
%     OSD4(:,1), OSD4(:,2), 'b-s',...
%     OSD3_pnc_psc(:,1), OSD3_pnc_psc(:,2), 'm-h',...
%     OSD4_pnc_psc(:,1), OSD4_pnc_psc(:,2), 'm-s',...
%     Proposed3(:,1), Proposed3(:,2), 'r-h',...
%     Proposed4(:,1), Proposed4(:,2), 'r-s');
% hold on;
% grid on;
% %图例，与上面的曲线先后对应
% legend('OSD (order=3)',...
%     'OSD (order=4)',...
%     'Fast\_OSD (order=3)',...
%     'Fast\_OSD (order=4)',...
%     'Proposed (order=3)',...
%     'Proposed (order=4)');
% title('Polar code, N=128 k=42 CRC\_length=11');
% xlabel('{\it E_b/N}_0(dB)');%横坐标标号
% ylabel('BER');%纵坐标标号
% set(get(gca,'Children'),'linewidth',linewidth,'markersize', marksize);%设置图中线宽,标记大小
% set(gca, 'XTick', 0:0.5:11);%设置横坐标
% % axis([0 10 1e-6 1]);%横纵坐标范围
% print(gcf, '-depsc', 'BER.eps');%保存为eps格式的图片color
% print(gcf, '-dpng', 'BER.png');%保存为pdf格式的图片color
% print(gcf, '-dpdf', 'BER.pdf');%保存为pdf格式的图片color
%-------------------------Figure2-----------------------------
