#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Nov 25 18:11:10 2024

@author: jack
"""



import os
import sys


import matplotlib
# matplotlib.use('TkAgg')
# matplotlib.use('Agg')
import matplotlib.pyplot as plt
# from mpl_toolkits.axes_grid1.inset_locator import mark_inset
# from mpl_toolkits.axes_grid1.inset_locator import inset_axes
# from matplotlib.patches import ConnectionPatch
import numpy as np
# import torch
from matplotlib.font_manager import FontProperties
from matplotlib.pyplot import MultipleLocator
import socket, getpass
from scipy.signal import savgol_filter

# 获取当前系统主机名
host_name = socket.gethostname()
# 获取当前系统用户名
user_name = getpass.getuser()
# 获取当前系统用户目录
user_home = os.path.expanduser('~')
home = os.path.expanduser('~')

# 本项目自己编写的库
# from option import args
sys.path.append("..")
# checkpoint
# import Utility



fontpath = "/usr/share/fonts/truetype/windows/"
# fname =  "/usr/share/fonts/truetype/arphic/SimSun.ttf",
font = FontProperties(fname=fontpath+"simsun.ttf", size=22)
fontpath1 = "/usr/share/fonts/truetype/msttcorefonts/"
fonte = FontProperties(fname=fontpath1+"Times_New_Roman.ttf", size=22)
fontpath2 = "/usr/share/fonts/truetype/NerdFonts/"
font1 = FontProperties(fname=fontpath2+"Caskaydia Cove ExtraLight Nerd Font Complete.otf", size=20)

# mark  = ['s','v','*', 'o', 'd', '>', '1', 'p', '2', 'h', 'P', '3', '|', 'X', '4', '8', 'H', '+', 'x', 'D', '_', '$\\clubsuit$', '$\\bowtie$', '$\\boxdot$', '$\\boxtimes$', '$\\boxminus$',  '$\\boxplus$', '$\\bigodot$','$\\bigoplus$', '$\\bigotimes$', '$\\bigstar$', '$\\blacksquare$', '$\circledR$', '$\circledS$',  '$\\bigtriangledown$','$\\bigtriangleup$','$\\blacktriangleleft$', '$\\blacktriangleright$', '$\\diamondsuit',   '$\heartsuit$', '$666$', '$\\varrho$', '$\\Omega$', '$\\nabla$', '$\\Upsilon$', '$\\mho$', '$\\Phi$',  '$\\divideontimes$', '$\\otimes$', '$\\odot$', '$\\ominus$', '$\\oplus$', '$\\oslash$', '$\\otimes$']

color = ['#1E90FF','#FF6347','#00FF00','#0000FF','#4ea142','#FF00FF','#FFA500','#800080','#FF0000','#EE82EE','#00FFFF','#9932CC','#00CED1','#CD5C5C',  '#7B68EE','#808000']
lsty = [(0, (3, 10, 1, 10, 1, 10)), (0, (1, 1)), (0, (1, 2)), (0, (5, 1)), (0, (1, 10)), (0, (1, 2)),  (0, (5, 10)), (0, (5, 5)), (0, (3, 10, 1, 10)), (0, (3, 5, 1, 5)), (0, (3, 5, 1, 5, 1, 5)),  '-', ':', '--', '-.', ]
alabo = ['(a)', '(b)', '(c)', '(d)', '(e)', '(f)', '(g)', '(h)']


# 第一组数据，第一列是Eb/N0或SNR, 第二列是BER，第三列是WER，下同。
Joint_fastfading_2u_wo_powdiv = np.array([[0.00, 1.00000000, 0.23165365, 0.35947917, 0.00000000, 25.000],
                                        # [1.00, 1.00000000, 0.20500000, 0.32210937, 0.00000000, 25.000],
                                        [2.00, 1.00000000, 0.17777344, 0.28313802, 0.00000000, 25.000],
                                        [3.00, 1.00000000, 0.14467448, 0.23319010, 0.00000000, 25.000],
                                        [4.00, 1.00000000, 0.09983073, 0.16889323, 0.00000000, 25.000],
                                        [5.00, 0.09874918, 0.00545949, 0.00943003, 0.00000000, 11.456],
                                        [5.20, 0.01292511, 0.00062138, 0.00110505, 0.00000000, 7.725],
                                        [5.400, 0.0011117763, 0.0000555387, 0.000109, 0.00, 5.85]
                                        ])

sic_fastfading_2u_wo_powdiv = np.array([[0.00, 1.00000000, 0.25546875, 0.39125000, 0.00000000, 50.000],
                                        # [1.00, 1.00000000, 0.23787109, 0.36484375, 0.00000000, 50.000],
                                        [2.00, 1.00000000, 0.21882813, 0.33773437, 0.00000000, 50.000],
                                        # [3.00, 1.00000000, 0.20036458, 0.31108073, 0.00000000, 50.000],
                                        [4.00, 1.00000000, 0.17956380, 0.27861979, 0.00000000, 50.000],
                                        # [5.00, 1.00000000, 0.15955078, 0.24932292, 0.00000000, 50.000],
                                        [6.00, 0.99337748, 0.14156923, 0.22256571, 0.00000000, 49.811],
                                        [7.00, 0.97402597, 0.11925477, 0.19133015, 0.00000000, 49.198],
                                        [8.00, 0.89820359, 0.09909478, 0.15879959, 0.00000000, 46.512],
                                        [9.00, 0.60728745, 0.05944775, 0.09742694, 0.00000000, 35.287],
                                        [10.00, 0.40322581, 0.03479135, 0.05750168, 0.00000000, 26.935],
                                        [11.00, 0.18750000, 0.01560791, 0.02573975, 0.00000000, 16.983],
                                        [12.00, 0.07552870, 0.00599755, 0.00990527, 0.00000000, 11.275],
                                        [13.00, 0.03085150, 0.00243638, 0.00397093, 0.00000000, 8.316],

                                        ])

Joint_fastfading_2u_w_powdiv = np.array([[0.00, 1.00000000, 0.23845052, 0.38699219, 0.00000000, 25.000],
                                        # [1.00, 1.00000000, 0.21098307, 0.35203125, 0.00000000, 25.000],
                                        [2.00, 0.99668874, 0.17650559, 0.30993895, 0.00000000, 25.000],
                                        # [3.00, 0.62761506, 0.12326752, 0.23896770, 0.00000000, 25.000],
                                        [4.00, 0.50167224, 0.10088968, 0.20172711, 0.00000000, 25.000],
                                       # [5.00, 0.50000000, 0.08727214, 0.17454427, 0.00000000, 25.000],
                                       [6.00, 0.50000000, 0.06933594, 0.13867188, 0.00000000, 25.000],
                                       [7.00, 0.50000000, 0.05056966, 0.10113932, 0.00000000, 25.000],
                                       [8.00, 0.31380753, 0.01774361, 0.03548722, 0.00000000, 20.108],
                                       [9., 0.0002882398, 0.0000161384, 0.000032, 0.00000000, 4.015]
                                        ])

## 不等功率分配, 4倍等间隔
sic_fastfading_2u_w_powdiv_4 = np.array([[0.00, 1.00000000, 0.24682292, 0.39505208, 0.00000000, 50.000],
                                        # [1.00, 0.98684211, 0.21955952, 0.36262593, 0.00000000, 49.760],
                                        [2.00, 0.92331288, 0.18192221, 0.31672977, 0.00000000, 47.991],
                                        # [3.00, 0.58593750, 0.12744904, 0.24619293, 0.00000000, 36.422],
                                        [4.00, 0.50675676, 0.10365089, 0.20672113, 0.00000000, 30.078],
                                        # [5.00, 0.50000000, 0.08607096, 0.17214193, 0.00000000, 28.452],
                                        [6.00, 0.49833887, 0.06590986, 0.13181972, 0.00000000, 27.648],
                                        [7.00, 0.38167939, 0.03382683, 0.06765367, 0.00000000, 23.934],
                                        [8.00, 0.03512881, 0.00233277, 0.00466554, 0.00000000, 10.015],
                                        [9, 0.0001237317, 0.0000072326, 0.000013, 0.00000000, 5.015]
                                        ])

## 不等功率分配, 3倍等间隔
sic_fastfading_2u_w_powdiv_3 = np.array([[0.00, 1.00000000, 0.24841797, 0.39122396, 0.00000000, 50.000],
                                        # [1.00, 1.00000000, 0.22289063, 0.35830729, 0.00000000, 50.000],
                                        [2.00, 0.97402597, 0.19109553, 0.31792817, 0.00000000, 49.461],
                                        # [3.00, 0.82240437, 0.14547046, 0.25955217, 0.00000000, 45.107],
                                        [4.00, 0.55970149, 0.09465368, 0.18360104, 0.00000000, 34.308],
                                        # [5.00, 0.49668874, 0.06756713, 0.13490144, 0.00000000, 29.588],
                                        [6.00, 0.38461538, 0.03489333, 0.06978666, 0.00000000, 25.585],
                                        [7.00, 0.03983006, 0.00264989, 0.00529978, 0.00000000, 11.193],
                                        ])

## 不等功率分配, 2倍等间隔
sic_fastfading_2u_w_powdiv_2 = np.array([[0.00, 1.00000000, 0.24831380, 0.38549479, 0.00000000, 50.000],
                                        # [1.00, 1.00000000, 0.22752604, 0.35559896, 0.00000000, 50.000],
                                        [2.00, 1.00000000, 0.20391276, 0.32436198, 0.00000000, 50.000],
                                        # [3.00, 0.99013158, 0.17608321, 0.28619706, 0.00000000, 49.720],
                                        [4.00, 0.88235294, 0.13060087, 0.22153033, 0.00000000, 46.847],
                                        [5.00, 0.50675676, 0.05751161, 0.10180664, 0.00000000, 35.106],
                                        [6.00, 0.05224660, 0.00545154, 0.00943568, 0.00000000, 14.158],
                                        ])


def SISO_2user():
    width = 10
    high  = 8
    fig, axs = plt.subplots(1, 1, figsize=(width, high), constrained_layout = True)# constrained_layout=True
    cols = 2
    ##=============================== LDPC =========================================

    ##=========================   ===============================
    lb = "Proposed, w/o PowAllo"
    axs.semilogy(Joint_fastfading_2u_wo_powdiv[:, 0], Joint_fastfading_2u_wo_powdiv[:, cols], color = 'r', ls = '--',  marker = '*', mfc = 'none', ms = 16, mew = 2, label = lb,)

    # #=========================  ===============================
    lb = "SIC, w/o pow div"
    axs.semilogy(sic_fastfading_2u_wo_powdiv[:, 0], sic_fastfading_2u_wo_powdiv[:, cols], color = 'b',ls = '--', lw = 2,  marker = 'o', mfc = 'none', ms = 16, mew = 2, label = lb)

    lb = r"Joint, w/ PowAllo, $\rho$=4"
    axs.semilogy(Joint_fastfading_2u_w_powdiv[:, 0], Joint_fastfading_2u_w_powdiv[:, cols], color = 'r', ls = '--', lw = 2,  marker = 'o', mfc = 'none', ms = 18, mew = 2, label = lb,)

    lb = r"SIC, w/ PowAllo, $\rho$=2"
    axs.semilogy(sic_fastfading_2u_w_powdiv_2[:, 0], sic_fastfading_2u_w_powdiv_2[:, cols], color = 'b', ls='--', lw = 2,  marker = 's', mfc = 'none', ms = 12, mew = 2, label = lb)

    lb = r"SIC, w/ PowAllo, $\rho$=3"
    axs.semilogy(sic_fastfading_2u_w_powdiv_3[:, 0], sic_fastfading_2u_w_powdiv_3[:, cols], color = 'b', ls='--', lw = 2,  marker = 'p', mfc = 'none', ms = 16, mew = 2, label = lb)

    lb = r"SIC, w/ PowAllo, $\rho$=4"
    axs.semilogy(sic_fastfading_2u_w_powdiv_4[:, 0], sic_fastfading_2u_w_powdiv_4[:, cols], color = 'b', ls='--', lw = 2,  marker = '*', mfc = 'none', ms = 16, mew = 2, label = lb)

    ##===========================================================
    # plt.gca().invert_xaxis()

    axs.grid(linestyle = (0, (5, 10)), linewidth = 0.5 )
    # label
    font = {'family':'Times New Roman','style':'normal','size':35}
    axs.set_xlabel("SNR (dB)", fontproperties=font)
    if cols == 1:
        axs.set_ylabel( "FER",      fontproperties = font )# , fontdict = font1
    elif cols == 2:
        axs.set_ylabel( "BER",      fontproperties = font )# , fontdict = font1
    elif cols == 3:
        axs.set_ylabel( "Aggregation error rate",      fontproperties = font )# , fontdict = font1
    #font1 = FontProperties(fname=fontpath1+"Times_New_Roman.ttf", size = 22)
    # font1 = FontProperties(fname=fontpath2+"Caskaydia Cove ExtraLight Nerd Font Complete.otf", size=16)
    font1 = {'family':'Times New Roman','style':'normal','size':22, }
    legend1 = axs.legend(loc = 'best', borderaxespad = 0, edgecolor = 'black', prop = font1,)
    frame1 = legend1.get_frame()
    frame1.set_alpha(1)
    frame1.set_facecolor('none')  # 设置图例legend背景透明

    bw = 2.5
    axs.spines['bottom'].set_linewidth(bw) ###设置底部坐标轴的粗细
    axs.spines['left'].set_linewidth(bw)   ###设置左边坐标轴的粗细
    axs.spines['right'].set_linewidth(bw)  ###设置右边坐标轴的粗细
    axs.spines['top'].set_linewidth(bw)    ###设置上部坐标轴的粗细

    axs.tick_params(direction = 'in', axis = 'both', top=True, right = True, labelsize = 16, width = bw)
    labels = axs.get_xticklabels() + axs.get_yticklabels()
    [label.set_fontname('Times New Roman') for label in labels]
    [label.set_fontsize(30) for label in labels] #刻度值字号

    fontt = {'family':'Times New Roman','style':'normal','size':35 }
    plt.suptitle("2 User, Fastfading, BPSK, [1024, 512]", fontproperties = fontt, )
    out_fig = plt.gcf()

    if cols == 1:
        out_fig.savefig("./Figures/2user_fer.eps")
        out_fig.savefig("./Figures/2user_fer.pdf")
    elif cols == 2:
        out_fig.savefig( "./Figures/2user_ber.eps")
        out_fig.savefig( "./Figures/2user_ber.pdf")
    elif cols == 3:
        out_fig.savefig( "./Figures/2user_aggerr.eps")
        out_fig.savefig( "./Figures/2user_aggerr.pdf")
    plt.show()
    plt.close()
    return

SISO_2user()


Joint_fastfading_6u_wo_powdiv = np.array([[0.00, 1.00000000, 0.37083984, 0.66777344, 0.00000000, 8.333],
                                        # [1.00, 1.00000000, 0.36387370, 0.66738281, 0.00000000, 8.333],
                                        # [2.00, 1.00000000, 0.35673828, 0.65824219, 0.00000000, 8.333],
                                        # [3.00, 1.00000000, 0.34981120, 0.65503906, 0.00000000, 8.333],
                                        # [4.00, 1.00000000, 0.34153646, 0.64300781, 0.00000000, 8.333],
                                        [5.00, 1.00000000, 0.33445964, 0.63210937, 0.00000000, 8.333],
                                        # [6.00, 1.00000000, 0.32084635, 0.62257812, 0.00000000, 8.333],
                                        # [7.00, 1.00000000, 0.31232422, 0.61121094, 0.00000000, 8.333],
                                        # [8.00, 1.00000000, 0.29671224, 0.58941406, 0.00000000, 8.333],
                                        # [9.00, 1.00000000, 0.28407552, 0.56863281, 0.00000000, 8.333],
                                        [10.00, 1.00000000, 0.26832031, 0.53761719, 0.00000000, 8.333],
                                        # [11.00, 1.00000000, 0.24811198, 0.50742188, 0.00000000, 8.333],
                                        # [12.00, 1.00000000, 0.22247396, 0.46437500, 0.00000000, 8.333],
                                        # [13.00, 1.00000000, 0.18227865, 0.40273437, 0.00000000, 8.333],
                                        [13.40, 1.00000000, 0.15913411, 0.36027344, 0.00000000, 8.333],
                                        [13.80, 0.73529412, 0.09713446, 0.22865924, 0.00000000, 7.326],
                                        [14.00, 0.15875527, 0.01760285, 0.04270916, 0.00000000, 4.055],
                                        [14.20, 0.01456171, 0.00159719, 0.00378404, 0.00000000, 2.329],
                                        [14.4, 0.0006996677, 0.0000789176, 0.000203, 0.00000000, 1.329],
                                        ])

SIC_fastfading_6u_wo_powdiv = np.array([[0.00, 1.00000000, 0.38196615, 0.73707031, 0.00000000, 50.000],
                                        # [1.00, 1.00000000, 0.37513021, 0.73523437, 0.00000000, 50.000],
                                        # [2.00, 1.00000000, 0.36974609, 0.72488281, 0.00000000, 50.000],
                                        # [3.00, 1.00000000, 0.36529297, 0.71785156, 0.00000000, 50.000],
                                        # [4.00, 1.00000000, 0.36050781, 0.71574219, 0.00000000, 50.000],
                                        [5.00, 1.00000000, 0.35401042, 0.70488281, 0.00000000, 50.000],
                                        # [6.00, 1.00000000, 0.35312500, 0.70210938, 0.00000000, 50.000],
                                        # [7.00, 1.00000000, 0.34965495, 0.68859375, 0.00000000, 50.000],
                                        # [8.00, 1.00000000, 0.34514323, 0.69296875, 0.00000000, 50.000],
                                        # [9.00, 1.00000000, 0.34696615, 0.68527344, 0.00000000, 50.000],
                                        [10.00, 1.00000000, 0.34229167, 0.68410156, 0.00000000, 50.000],
                                        # [11.00, 1.00000000, 0.34274740, 0.67925781, 0.00000000, 50.000],
                                        # [12.00, 1.00000000, 0.33716797, 0.66898437, 0.00000000, 50.000],
                                        # [13.00, 1.00000000, 0.33863281, 0.67410156, 0.00000000, 50.000],
                                        # [14.00, 1.00000000, 0.33473307, 0.66984375, 0.00000000, 50.000],
                                        # [15.00, 1.00000000, 0.33824219, 0.66847656, 0.00000000, 49.387],
                                        [16.00, 1.00000000, 0.33772786, 0.66687500, 0.00000000, 49.387],
                                        # [17.00, 1.00000000, 0.33986328, 0.67804688, 0.00000000, 47.547],
                                        # [18.00, 1.00000000, 0.34796875, 0.70066406, 0.00000000, 44.313],
                                        # [19.00, 1.00000000, 0.35804036, 0.72574219, 0.00000000, 41.800],
                                        # [20.00, 1.00000000, 0.35859375, 0.72218750, 0.00000000, 41.097],
                                        # [21.00, 1.00000000, 0.35669271, 0.71898438, 0.00000000, 41.247],
                                        # [22.00, 1.00000000, 0.36072266, 0.71769531, 0.00000000, 40.607],
                                        [23.00, 1.00000000, 0.36246745, 0.73414062, 0.00000000, 39.437],

                                        ])

Joint_fastfading_6u_w_powdiv = np.array([[0.00, 1.00000000, 0.39086589, 0.67398437, 0.00000000, 8.333],
                                        # [1.00, 1.00000000, 0.38416667, 0.66886719, 0.00000000, 8.333],
                                        # [1.80, 1.00000000, 0.37240234, 0.67046875, 0.00000000, 8.333],
                                        # [2.00, 1.00000000, 0.36930990, 0.67035156, 0.00000000, 8.333],
                                        # [3.00, 0.99673203, 0.35257736, 0.66172641, 0.00000000, 8.333],
                                        # [4.00, 0.85028249, 0.32984088, 0.64731197, 0.00000000, 8.333],
                                        [5.00, 0.83333333, 0.32046984, 0.65061849, 0.00000000, 8.333],
                                        # [6.00, 0.83333333, 0.31089952, 0.64029948, 0.00000000, 8.333],
                                        # [7.00, 0.83333333, 0.29854601, 0.63395182, 0.00000000, 8.333],
                                        # [8.00, 0.83333333, 0.28662109, 0.63229167, 0.00000000, 8.333],
                                        # [9.00, 0.82513661, 0.27202335, 0.62032531, 0.00000000, 8.333],
                                        [10.00, 0.69907407, 0.25119358, 0.61366102, 0.00000000, 8.333],
                                        # [11.00, 0.66666667, 0.24006944, 0.60312500, 0.00000000, 8.333],
                                        # [12.00, 0.66666667, 0.23006510, 0.59755208, 0.00000000, 8.333],
                                        # [13.00, 0.66666667, 0.21986979, 0.59164063, 0.00000000, 8.333],
                                        # [14.00, 0.66666667, 0.20886285, 0.58671875, 0.00000000, 8.333],
                                        [15.00, 0.65584416, 0.19231940, 0.56693892, 0.00000000, 8.333],
                                        # [16.00, 0.52256944, 0.17173258, 0.54774984, 0.00000000, 8.333],
                                        # [17.00, 0.50000000, 0.16154622, 0.53583984, 0.00000000, 8.333],
                                        # [18.00, 0.50000000, 0.15246419, 0.52503906, 0.00000000, 8.333],
                                        # [19.00, 0.50000000, 0.14383789, 0.51310547, 0.00000000, 8.333],
                                        [20.00, 0.50000000, 0.13218099, 0.50048828, 0.00000000, 8.333],
                                        [21.00, 0.48237179, 0.11660219, 0.47348257, 0.00000000, 8.333],

                                        ])

## 不等功率分配, 4倍等间隔
sic_fastfading_6u_w_powdiv_4 = np.array([[0.00, 1.00000000, 0.39744792, 0.74453125, 0.00000000, 50.000],
                                       # [1.00, 1.00000000, 0.38712240, 0.73613281, 0.00000000, 50.000],
                                        # [2.00, 1.00000000, 0.37417969, 0.73871094, 0.00000000, 50.000],
                                        # [3.00, 0.94135802, 0.35455247, 0.73318142, 0.00000000, 48.596],
                                        # [4.00, 0.86494253, 0.33592628, 0.72053475, 0.00000000, 45.305],
                                        [5.00, 0.83333333, 0.32434353, 0.72197266, 0.00000000, 43.464],
                                        # [6.00, 0.83333333, 0.31606988, 0.71074219, 0.00000000, 42.858],
                                        # [7.00, 0.83333333, 0.30690104, 0.70885417, 0.00000000, 42.633],
                                        # [8.00, 0.83060109, 0.29308081, 0.70216445, 0.00000000, 42.421],
                                        # [9.00, 0.79629630, 0.27765377, 0.68960813, 0.00000000, 41.593],
                                        [10.00, 0.68721461, 0.25458851, 0.67548694, 0.00000000, 37.379],
                                        # [11.00, 0.66888889, 0.24416667, 0.67010417, 0.00000000, 35.707],
                                        # [12.00, 0.66666667, 0.23534288, 0.66632813, 0.00000000, 35.124],
                                        # [13.00, 0.66666667, 0.22606337, 0.65692708, 0.00000000, 34.827],
                                        # [14.00, 0.66447368, 0.21501079, 0.64489104, 0.00000000, 34.625],
                                        [15.00, 0.61934156, 0.19501511, 0.62405961, 0.00000000, 33.200],
                                        # [16.00, 0.52256944, 0.17637126, 0.60569255, 0.00000000, 29.427],
                                        # [17.00, 0.50166667, 0.16763346, 0.59480469, 0.00000000, 27.887],
                                        # [18.00, 0.50000000, 0.15745768, 0.57839844, 0.00000000, 27.242],
                                        # [19.00, 0.50000000, 0.14891602, 0.55494141, 0.00000000, 27.042],
                                        [20.00, 0.49504950, 0.13609994, 0.53420869, 0.00000000, 26.677],
                                        # [21.00, 0.44940476, 0.12119838, 0.50545829, 0.00000000, 25.222],
                                        # [22.00, 0.34953704, 0.10157606, 0.46188694, 0.00000000, 21.405],
                                        # [23.00, 0.33333333, 0.09305990, 0.43490885, 0.00000000, 19.818],
                                        # [24.00, 0.33333333, 0.08592665, 0.40828125, 0.00000000, 19.353],
                                        [25.00, 0.33333333, 0.07750000, 0.37652344, 0.00000000, 19.061],
                                        # [26.00, 0.32051282, 0.06576982, 0.33408454, 0.00000000, 18.560],
                                        # [27.00, 0.22727273, 0.04737660, 0.26676136, 0.00000000, 15.708],
                                        # [28.00, 0.17182131, 0.03660264, 0.21862248, 0.00000000, 12.531],
                                        # [29.00, 0.16722408, 0.03105295, 0.18618703, 0.00000000, 11.591],
                                        [30.00, 0.16666667, 0.02507704, 0.15046224, 0.00000000, 11.218],
                                        [31.00, 0.15243902, 0.01596541, 0.09579244, 0.00000000, 10.715],
                                        [32.00, 0.04139073, 0.00288469, 0.01730812, 0.00000000, 6.780],
                                        [33., 0.0003456885, 0.0000211304, 0.000127, 0.00000000, 3.780],
                                        ])
## 不等功率分配, 3倍等间隔
sic_fastfading_6u_w_powdiv_3 = np.array([[0.00, 1.00000000, 0.39220703, 0.73699219, 0.00000000, 50.000],
                                        # [1.00, 1.00000000, 0.38479167, 0.73953125, 0.00000000, 50.000],
                                        # [2.00, 1.00000000, 0.37159505, 0.73445313, 0.00000000, 50.000],
                                        # [3.00, 0.99673203, 0.36057496, 0.72422641, 0.00000000, 49.980],
                                        # [4.00, 0.97756410, 0.34500200, 0.72581130, 0.00000000, 49.359],
                                        [5.00, 0.91818182, 0.32346117, 0.71590909, 0.00000000, 47.548],
                                        # [6.00, 0.84444444, 0.30217014, 0.70172526, 0.00000000, 44.797],
                                        # [7.00, 0.83611111, 0.29174262, 0.69768880, 0.00000000, 43.558],
                                        # [8.00, 0.83333333, 0.27942708, 0.68730469, 0.00000000, 42.947],
                                        # [9.00, 0.81451613, 0.26494246, 0.67990801, 0.00000000, 42.341],
                                        [10.00, 0.72463768, 0.23678574, 0.65800498, 0.00000000, 39.053],
                                        [15.00, 0.53191489, 0.15652704, 0.56025598, 0.00000000, 30.784],
                                        [20.00, 0.34597701, 0.08153287, 0.38201778, 0.00000000, 21.732],

                                        ])
## 不等功率分配, 2倍等间隔
sic_fastfading_6u_w_powdiv_2 = np.array([[0.00, 1.00000000, 0.38400391, 0.73773438, 0.00000000, 50.000],
                                         [5.00, 1.00000000, 0.34078776, 0.70523437, 0.00000000, 50.000],
                                         [10.00, 0.97115385, 0.28774164, 0.66150841, 0.00000000, 49.340],
                                         ])


def SISO_6user():
    width = 10
    high  = 8
    fig, axs = plt.subplots(1, 1, figsize=(width, high), constrained_layout = True) # constrained_layout = True
    cols = 2
    ##=============================== LDPC =========================================

    ##=========================   ===============================
    lb = "Proposed, w/o PowAllo"
    axs.semilogy(Joint_fastfading_6u_wo_powdiv[:, 0], Joint_fastfading_6u_wo_powdiv[:, cols], color = 'r', ls = '--',  marker = 'o', mfc = 'none', ms = 12, mew = 2, label = lb,)

    # #=========================  ===============================
    lb = "SIC, w/o PowAllo"
    # axs.semilogy(SIC_fastfading_6u_wo_powdiv[:, 0], SIC_fastfading_6u_wo_powdiv[:, cols], color = 'r', ls = '-', lw = 3,marker = '*', mfc = 'none', ms = 12, mew = 2,  label = lb)

    lb = "Proposed, w/ PowAllo"
    axs.semilogy(Joint_fastfading_6u_w_powdiv[:, 0], Joint_fastfading_6u_w_powdiv[:, cols], color = 'r', ls = '--', lw = 2,  marker = 'o', mfc = 'none', ms = 18, mew = 2,  label = lb,)

    lb = r"SIC, w/ PowAllo, $\rho$=2"
    axs.semilogy(sic_fastfading_6u_w_powdiv_2[:, 0], sic_fastfading_6u_w_powdiv_2[:, cols], color = 'b', ls='--', lw = 2, marker = 's', mfc = 'none', ms = 12, mew = 2,  label = lb)


    lb = r"SIC, w/ PowAllo, $\rho$=3"
    axs.semilogy(sic_fastfading_6u_w_powdiv_3[:, 0], sic_fastfading_6u_w_powdiv_3[:, cols], color = 'b', ls='--', lw = 2, marker = 'p', mfc = 'none', ms = 12, mew = 2,  label = lb)

    lb = r"SIC, w/ PowAllo, $\rho$=4"
    axs.semilogy(sic_fastfading_6u_w_powdiv_4[:, 0], sic_fastfading_6u_w_powdiv_4[:, cols], color = 'b', ls='--', lw = 2, marker = '*', mfc = 'none', ms = 12, mew = 2,  label = lb)
    #=========================   ===============================

    ##===========================================================
    # plt.gca().invert_xaxis()

    axs.grid(linestyle = (0, (5, 10)), linewidth = 0.5 )
    # label
    font = {'family':'Times New Roman','style':'normal','size':35}
    axs.set_xlabel("SNR (dB)", fontproperties=font)
    if cols == 1:
        axs.set_ylabel( "FER",      fontproperties = font )# , fontdict = font1
    elif cols == 2:
        axs.set_ylabel( "BER",      fontproperties = font )# , fontdict = font1
    elif cols == 3:
        axs.set_ylabel( "Aggregation error rate",      fontproperties = font )# , fontdict = font1
    #font1 = FontProperties(fname=fontpath1+"Times_New_Roman.ttf", size = 22)
    # font1 = FontProperties(fname=fontpath2+"Caskaydia Cove ExtraLight Nerd Font Complete.otf", size=16)
    font1 = {'family':'Times New Roman','style':'normal','size':22, }
    legend1 = axs.legend(loc = 'best', borderaxespad = 0, edgecolor = 'black', prop = font1,)
    frame1 = legend1.get_frame()
    frame1.set_alpha(1)
    frame1.set_facecolor('none')  # 设置图例legend背景透明

    bw = 2.5
    axs.spines['bottom'].set_linewidth(bw) ###设置底部坐标轴的粗细
    axs.spines['left'].set_linewidth(bw)   ###设置左边坐标轴的粗细
    axs.spines['right'].set_linewidth(bw)  ###设置右边坐标轴的粗细
    axs.spines['top'].set_linewidth(bw)    ###设置上部坐标轴的粗细

    axs.tick_params(direction = 'in', axis = 'both', top=True, right = True, labelsize = 16, width = bw)
    labels = axs.get_xticklabels() + axs.get_yticklabels()
    [label.set_fontname('Times New Roman') for label in labels]
    [label.set_fontsize(30) for label in labels] #刻度值字号

    fontt = {'family':'Times New Roman','style':'normal','size':35 }
    plt.suptitle("6 User, Fastfading, BPSK, [1024, 512]", fontproperties = fontt, )
    out_fig = plt.gcf()

    if cols == 1:
        out_fig.savefig("./Figures/6user_fer.eps")
        out_fig.savefig("./Figures/6user_fer.pdf")
    elif cols == 2:
        out_fig.savefig( "./Figures/6user_ber.eps")
        out_fig.savefig( "./Figures/6user_ber.pdf")
    elif cols == 3:
        out_fig.savefig( "./Figures/6user_aggerr.eps")
        out_fig.savefig( "./Figures/6user_aggerr.pdf")
    plt.show()
    plt.close()
    return

SISO_6user()

































