#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Wed Mar  9 16:43:03 2022

@author: jack


数字格式类型
类型	含义
d	小数整数
c	对应的Unicode字符
b	二进制格式
o	八进制格式
x	十六进制格式（小写）
X	十六进制格式（大写）
n	与“ d”相同。除了使用数字分隔符的当前语言环境设置
e	指数表示法。（小写字母e）
E	指数符号（大写E）
f	显示定点编号（默认值：6）
F	与“ f”相同。除了将“ inf”显示为“ INF”和“ nan”显示为“ NAN”
g	通用格式。将数字四舍五入为p个有效数字。（默认精度：6）
G	与“ g”相同。如果数量很大，则除外切换到“ E”。
%	百分比。乘以100并以％结尾。

"""

#========================================================================
# https://www.cainiaojc.com/python/python-methods-string-format.html
#========================================================================
# 默认参数
print("Hello {}, your balance is {}.".format("Adam", 230.2346))

# 位置参数
print("Hello {0}, your balance is {1}.".format("Adam", 230.2346))

# 关键词参数
print("Hello {name}, your balance is {blc}.".format(name="Adam", blc=230.2346))

# 混合参数
print("Hello {0}, your balance is {blc}.".format("Adam", blc=230.2346))


# 整数参数
print("数字:{:d}".format(123))

# 浮点参数
print("浮点数:{:f}".format(123.4567898))

# 八进制，二进制和十六进制格式
print("bin: {0:b}, oct: {0:o}, hex: {0:x}".format(12))


#========================================================================
# 最小宽度的整数
print("{:5d}".format(12))

# 宽度对于比填充更长的数字不起作用
print("{:2d}".format(1234))

# 浮点数的填充
print("{:8.3f}".format(12.2346))

# 最小宽度为0的整数
print("{:05d}".format(12))

# 填充用0填充的浮点数
print("{:08.3f}".format(12.2346))

"""
这里，

在第一个语句中，{:5d}采用整数参数并指定最小宽度5。由于未指定对齐方式，因此它向右对齐。

在第二个语句中，您可以看到宽度（2）小于数字（1234），因此它不需要在左边留任何空格，也不会截断该数字。

与整数不同，浮点数具有整数和小数部分。 并且，定义为该数字的最小宽度是整个包括“.”的两个部分。

在第三条语句中，{:8.3f}将小数部分截断为3位，四舍五入最后两位数字。而且，该数字现在为12.235，整个宽度为8，在左侧保留2个位置。

如果要用零填充其余位置，请在格式说明符之前放置零。它适用于整数和浮点数：{:05d}和{:08.3f}。
"""


#========================================================================

# 显示+号
print("{:+f} {:+f}".format(12.23, -12.23))

# 仅显示-号
print("{:-f} {:-f}".format(12.23, -12.23))

# 显示+号的空格
print("{: f} {: f}".format(12.23, -12.23))


#========================================================================
# 右对齐的整数
print("{:5d}".format(12))

# 具有中心对齐的浮点数
print("{:^10.3f}".format(12.2346))

# 整数左对齐，用0填充
print("{:<05d}".format(12))

# 中心对齐的浮点数
print("{:=8.3f}".format(-12.2346))

#========================================================================
# 左对齐的字符串填充
print("{:5}".format("cat"))

# 右对齐的字符串填充
print("{:>5}".format("cat"))

#中心对齐的字符串填充
print("{:^5}".format("cat"))

# 中心对齐的字符串填充
# 和 '*' 填充字符
print("{:*^5}".format("cat"))



#========================================================================

# 将字符串截断为3个字母
print("{:.3}".format("caterpillar"))

# 将字符串截断为3个字母
# 和 填充
print("{:5.3}".format("caterpillar"))

# 将字符串截断为3个字母,
# 填充和中心对齐
print("{:^5.3}".format("caterpillar"))




#========================================================================


# define Person class
class Person:
    age = 23
    name = "Adam"

# 格式化age
print("{p.name}'年龄是 : {p.age}".format(p=Person()))





#========================================================================


# 定义Person字典
person = {'age': 23, 'name': 'Adam'}

# 格式化age
print("{p[name]}'s age is: {p[age]}".format(p=person))





#========================================================================

# 定义Person字典
person = {'age': 23, 'name': 'Adam'}

# 格式化age
print("{name}'s age is: {age}".format(**person))






#========================================================================



# 动态字符串格式模板
string = "{:{fill}{align}{width}}"

# 将格式代码作为参数传递
print(string.format('cat', fill='*', align='^', width=5))

# 动态浮点格式模板
num = "{:{align}{width}.{precision}f}"

# 将格式代码作为参数传递
print(num.format(123.236, align='<', width=8, precision=2))




#========================================================================


import datetime
# 日期时间格式
date = datetime.datetime.now()
print("当前时间: {:%Y/%m/%d %H:%M:%S}".format(date))

# 复数格式
complexNumber = 1+2j
print("Real part: {0.real} and Imaginary part: {0.imag}".format(complexNumber))

# 自定义  __format__()方法
class Person:
    def __format__(self, format):
        if(format == 'age'):
            return '23'
        return 'None'

print("Adam's 年龄是: {:age}".format(Person()))

#========================================================================

# __str__() 和 __repr__() 简写为 !r 和 !s
print("Quotes: {0!r}, Without Quotes: {0!s}".format("cat"))

# __str__() 和 __repr__() 实现类
class Person:
    def __str__(self):
        return "STR"
    def __repr__(self):
        return "REPR"

print("repr: {p!r}, str: {p!s}".format(p=Person()))


#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



#========================================================================



    